foamCases/teste4/system/probesTime
probesTime
{
        // Where to load it from
        libs ( "libsampling.so" );
        type            probes;
        // Name of the directory for probe data
        name            probesTime;
        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  1;
        // Fields to be probed
        fields
        (
            p
        );

        probeLocations
		(
			(2.0 0 0)
			(2.003 0 0)
			(2.005 0 0)
			(2.008 0 0)
			(2.01 0 0)
			(2.013 0 0)
			(2.015 0 0)
			(2.018 0 0)
			(2.02 0 0)
			(2.023 0 0)
			(2.025 0 0)
			(2.028 0 0)
			(2.03 0 0)
			(2.033 0 0)
			(2.035 0 0)
			(2.038 0 0)
			(2.04 0 0)
			(2.043 0 0)
			(2.045 0 0)
			(2.048 0 0)
			(2.05 0 0)
			(2.053 0 0)
			(2.055 0 0)
			(2.058 0 0)
			(2.06 0 0)
			(2.063 0 0)
			(2.065 0 0)
			(2.068 0 0)
			(2.07 0 0)
			(2.073 0 0)
			(2.075 0 0)
			(2.078 0 0)
			(2.08 0 0)
			(2.083 0 0)
			(2.085 0 0)
			(2.088 0 0)
			(2.09 0 0)
			(2.093 0 0)
			(2.095 0 0)
			(2.098 0 0)
			(2.1 0 0)
			(2.103 0 0)
			(2.105 0 0)
			(2.108 0 0)
			(2.11 0 0)
			(2.113 0 0)
			(2.115 0 0)
			(2.118 0 0)
			(2.12 0 0)
			(2.123 0 0)
			(2.125 0 0)
			(2.128 0 0)
			(2.13 0 0)
			(2.133 0 0)
			(2.135 0 0)
			(2.138 0 0)
			(2.14 0 0)
			(2.143 0 0)
			(2.145 0 0)
			(2.148 0 0)
			(2.15 0 0)
			(2.153 0 0)
			(2.155 0 0)
			(2.158 0 0)
			(2.16 0 0)
			(2.163 0 0)
			(2.165 0 0)
			(2.168 0 0)
			(2.17 0 0)
			(2.173 0 0)
			(2.175 0 0)
			(2.178 0 0)
			(2.18 0 0)
			(2.183 0 0)
			(2.185 0 0)
			(2.188 0 0)
			(2.19 0 0)
			(2.193 0 0)
			(2.195 0 0)
			(2.198 0 0)
			(2.2 0 0)
			(2.203 0 0)
			(2.205 0 0)
			(2.208 0 0)
			(2.21 0 0)
			(2.213 0 0)
			(2.215 0 0)
			(2.218 0 0)
			(2.22 0 0)
			(2.223 0 0)
			(2.225 0 0)
			(2.228 0 0)
			(2.23 0 0)
			(2.233 0 0)
			(2.235 0 0)
			(2.238 0 0)
			(2.24 0 0)
			(2.243 0 0)
			(2.245 0 0)
...
		);

}
