foamCases/teste4/system/probesTimeFlow
probesTimeFlow
{
        // Where to load it from
        libs ( "libsampling.so" );
        type            probes;
        // Name of the directory for probe data
        name            probesTimeFlow;
        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  1;
        // Fields to be probed
        fields
        (
            p
        );

        probeLocations
		(
			(-100.0 0 0)
			(-99.995 0 0)
			(-99.99 0 0)
			(-99.985 0 0)
			(-99.98 0 0)
			(-99.975 0 0)
			(-99.97 0 0)
			(-99.965 0 0)
			(-99.96 0 0)
			(-99.955 0 0)
			(-99.95 0 0)
			(-99.945 0 0)
			(-99.94 0 0)
			(-99.935 0 0)
			(-99.93 0 0)
			(-99.925 0 0)
			(-99.92 0 0)
			(-99.915 0 0)
			(-99.91 0 0)
			(-99.905 0 0)
			(-99.9 0 0)
			(-99.895 0 0)
			(-99.89 0 0)
			(-99.885 0 0)
			(-99.88 0 0)
			(-99.875 0 0)
			(-99.87 0 0)
			(-99.865 0 0)
			(-99.86 0 0)
			(-99.855 0 0)
			(-99.85 0 0)
			(-99.845 0 0)
			(-99.84 0 0)
			(-99.835 0 0)
			(-99.83 0 0)
			(-99.825 0 0)
			(-99.82 0 0)
			(-99.815 0 0)
			(-99.81 0 0)
			(-99.805 0 0)
			(-99.8 0 0)
			(-99.795 0 0)
			(-99.79 0 0)
			(-99.785 0 0)
			(-99.78 0 0)
			(-99.775 0 0)
			(-99.77 0 0)
			(-99.765 0 0)
			(-99.76 0 0)
			(-99.755 0 0)
			(-99.75 0 0)
			(-99.745 0 0)
			(-99.74 0 0)
			(-99.735 0 0)
			(-99.73 0 0)
			(-99.725 0 0)
			(-99.72 0 0)
			(-99.715 0 0)
			(-99.71 0 0)
			(-99.705 0 0)
			(-99.7 0 0)
			(-99.695 0 0)
			(-99.69 0 0)
			(-99.685 0 0)
			(-99.68 0 0)
			(-99.675 0 0)
			(-99.67 0 0)
			(-99.665 0 0)
			(-99.66 0 0)
			(-99.655 0 0)
			(-99.65 0 0)
			(-99.645 0 0)
			(-99.64 0 0)
			(-99.635 0 0)
			(-99.63 0 0)
			(-99.625 0 0)
			(-99.62 0 0)
			(-99.615 0 0)
			(-99.61 0 0)
			(-99.605 0 0)
			(-99.6 0 0)
			(-99.595 0 0)
			(-99.59 0 0)
			(-99.585 0 0)
			(-99.58 0 0)
			(-99.575 0 0)
			(-99.57 0 0)
			(-99.565 0 0)
			(-99.56 0 0)
			(-99.555 0 0)
			(-99.55 0 0)
			(-99.545 0 0)
			(-99.54 0 0)
			(-99.535 0 0)
			(-99.53 0 0)
			(-99.525 0 0)
			(-99.52 0 0)
			(-99.515 0 0)
			(-99.51 0 0)
...
		);
        
}