foamCases/teste4/system/readme
- Com waveTransmissive
- Com zona de damping